Autodesk.Revit.DB.Structure.AnalyticalModelSelector.#ctor(Autodesk.Revit.DB.Curve)
Creates a selector based on a specific analytical curve.
curve:
The curve upon which this selector acts.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve points to a helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSelector.#ctor(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.Structure.AnalyticalCurveSelector)
Creates a selector based on one portion of a specific analytical curve.
curve:
The curve upon which this selector acts.
inCurveSelector:
Portion of the analytical curve in which the client is interested.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve points to a helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011